<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#INDEX" data-toc-modified-id="INDEX-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>INDEX</a></span><ul class="toc-item"><li><span><a href="#USE-SQUARE-BRACKETS" data-toc-modified-id="USE-SQUARE-BRACKETS-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>USE SQUARE BRACKETS</a></span></li><li><span><a href="#USE-COLUMN-ATTRIBUTE-AND-ROW-LABEL" data-toc-modified-id="USE-COLUMN-ATTRIBUTE-AND-ROW-LABEL-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>USE COLUMN ATTRIBUTE AND ROW LABEL</a></span></li><li><span><a href="#USE-.LOC-ACCESSOR" data-toc-modified-id="USE-.LOC-ACCESSOR-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>USE .LOC ACCESSOR</a></span></li><li><span><a href="#USE-.ILOC-ACCESSOR" data-toc-modified-id="USE-.ILOC-ACCESSOR-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>USE .ILOC ACCESSOR</a></span></li><li><span><a href="#SELECT-ONLY-SOME-COLUMNS" data-toc-modified-id="SELECT-ONLY-SOME-COLUMNS-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>SELECT ONLY SOME COLUMNS</a></span></li></ul></li><li><span><a href="#SLICE" data-toc-modified-id="SLICE-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>SLICE</a></span><ul class="toc-item"><li><span><a href="#USE-SQUARE-BRACKET" data-toc-modified-id="USE-SQUARE-BRACKET-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>USE SQUARE BRACKET</a></span></li><li><span><a href="#USE-.LOC" data-toc-modified-id="USE-.LOC-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>USE .LOC</a></span></li><li><span><a href="#USE-.ILOC" data-toc-modified-id="USE-.ILOC-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>USE .ILOC</a></span></li><li><span><a href="#SERIES-VS-1-COLUMN-DATAFRAME" data-toc-modified-id="SERIES-VS-1-COLUMN-DATAFRAME-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>SERIES VS 1-COLUMN DATAFRAME</a></span></li></ul></li></ul></div>

In [1]:
# More of this on intermediate python
import pandas as pd
df = pd.read_csv('sales.csv', index_col = 'month')
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### INDEX

#### USE SQUARE BRACKETS

In [2]:
# Sale of salt in Jan
df['salt']['Jan']

12.0

#### USE COLUMN ATTRIBUTE AND ROW LABEL

In [3]:
# Sale of eggs in Mar
df.eggs['Mar']

221

#### USE .LOC ACCESSOR

In [4]:
# Spam in May
df.loc['May', 'spam']

52

#### USE .ILOC ACCESSOR

In [5]:
# Spam in May
df.iloc[4,2]

52

#### SELECT ONLY SOME COLUMNS

In [6]:
# Sale in salt and eggs
df[['salt', 'eggs']]

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

### SLICE

#### USE SQUARE BRACKET

In [7]:
# Eggs and spam from Feb to Apr
df[['eggs', 'spam']][1:4]

       eggs  spam
month
Feb     110    31
Mar     221    72
Apr      77    20

#### USE .LOC

In [8]:
# All rows, some columns
df.loc[:, 'eggs':'salt']

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [9]:
# Some rows, all columns
df.loc['Jan':'Apr', :]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [10]:
# Some rows, some columns
df.loc['Mar':'May', 'salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [11]:
# Can use list rather than slice
df.loc['Mar':'May', ['salt','spam']]

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [12]:
# SLice in reverse order
df.loc['May':'Mar':-1]

       eggs  salt  spam
month
May     132   NaN    52
Apr      77  87.0    20
Mar     221  89.0    72

#### USE .ILOC

In [13]:
df.iloc[2:5, 1:]

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

#### SERIES VS 1-COLUMN DATAFRAME

In [14]:
df['eggs']
type(df['eggs'])

pandas.core.series.Series